package com.pingwit.lesson8.homework.task2;

import java.util.Scanner;

public class Task2 {
    /*
    Написать программу, которая определяет, является ли слово палиндромом.
(Палиндром - это слово, которое читается одинаково слева направо и справа налево. Примеры: "топот", "шалаш", "А роза упала на лапу Азора".)
Для работы со строками вам пригодится это - https://metanit.com/java/tutorial/7.1.php
     */
    /*public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        System.out.println("Enter your word: ");
        String word = scanner.next();
        char[] wordArray = word.toCharArray();
        String result = "";
        for (int i = wordArray.length - 1; i >= 0; i--) {
            result += wordArray[i];
        }
        }
    }*/
}
